Teori / Læringsmål
* Forstå Pandas Series og DataFrame.
* Lære grunnleggende operasjoner: opprette, indeksere, hente kolonner/rader.
* Begynn å tenke på Python-script utenfor notebook.

Oppgave:
* ~~Lag en liten DataFrame med eksempeldata for ansatte:
    Kolonner: Navn, Alder, Avdeling, Lønn
    Fyll inn 5–10 fiktive ansatte.~~

* ~~Utforsk DataFrame:
    Hent en kolonne (df['Lønn']).
    Hent en rad (df.iloc[0]).
    Skriv ut datatyper (df.dtypes).~~

* ~~Opprett en Series med fiktive sykefraværsdager (df['Sykefravær'])~~

In [4]:
import pandas as pd

In [11]:
df = pd.DataFrame([["Lise Hansen", 28, "HR", 550000], ["Knut Knutsen", 36, "IT", 780000], ["Arild Arildsen", 52, "Ledelse", 1020000], ["Helen Hansen", 43, "Finans", 980000], ["Stian Stiansen", 39, "Renholder", 510000]], columns=["Navn", "Alder", "Avdeling", "Lønn"])

In [29]:
df["Lønn"]

0     550000
1     780000
2    1020000
3     980000
4     510000
Name: Lønn, dtype: int64

In [ ]:
# loc[# rows, #columns] <- this allows us to filter by both row and column. Lets ut get several rows as well.
# e.g. df.loc[:, ["Navn", "Lønn"]], gives us all rows from the columns navn and lønn

# iloc is similar but instead of labels it uses index-position


# gives you the full row, in this case the first row in our dataframe. Python always starts from 0
df.iloc[0]

Navn        Lise Hansen
Alder                28
Avdeling             HR
Lønn             550000
Name: 0, dtype: object

In [ ]:
# see information about our DF. Column 1 and 3 use int64 == 64 bits == 8 bytes. 
# This is something we can play around with to be more efficient, by changing the engine

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Navn      5 non-null      object
 1   Alder     5 non-null      int64
 2   Avdeling  5 non-null      object
 3   Lønn      5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [23]:
df.describe()

           Alder          Lønn
count   5.000000  5.000000e+00
mean   39.600000  7.680000e+05
std     8.848729  2.359449e+05
min    28.000000  5.100000e+05
25%    36.000000  5.500000e+05
50%    39.000000  7.800000e+05
75%    43.000000  9.800000e+05
max    52.000000  1.020000e+06

In [ ]:
#numbers of unique values
df.nunique()

Navn        5
Alder       5
Avdeling    5
Lønn        5
dtype: int64

In [ ]:
# 5 rows and 4 columns
df.shape

(5, 4)

In [39]:
# Opprett en Series med fiktive sykefraværsdager (df['Sykefravær']).
import numpy as np
df["Sykefraværs_dager"] = np.random.randint(0,11, size=len(df))

In [46]:
df

             Navn  Alder   Avdeling     Lønn  Sykefraværs_dager
0     Lise Hansen     28         HR   550000                  2
1    Knut Knutsen     36         IT   780000                  3
2  Arild Arildsen     52    Ledelse  1020000                  6
3    Helen Hansen     43     Finans   980000                  3
4  Stian Stiansen     39  Renholder   510000                  6